temp1/src/Catalogs/АдреснаяКнига/АдреснаяКнига.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АдреснаяКнига</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Избранное</name>
    </items>
    <items>
      <name>Исполнители</name>
    </items>
    <items>
      <name>Заказчики</name>
    </items>
    <items>
      <name>ЛичныеАдресаты</name>
    </items>
  </predefined>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ГруппыЛичныхАдресатов</types>
      <types>CatalogRef.Заказчики</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Проекты</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДоступа</name>
    <type>
      <types>CatalogRef.Заказчики</types>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВАдреснойКниге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбъектаВСписке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительОбъекта</name>
    <comment>Реквизит предназначен для вычисления доступа к записи</comment>
    <type>
      <types>CatalogRef.Заказчики</types>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанныхОбъекта</name>
    <type>
      <types>EnumRef.ТипыДанныхАдреснойКниги</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/Enums/ТипыДанныхАдреснойКниги/ТипыДанныхАдреснойКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхАдреснойКниги</name>
  <enumValues>
    <name>Автогруппа</name>
  </enumValues>
  <enumValues>
    <name>АдресСпискаРассылки</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтактовПользователей</name>
  </enumValues>
  <enumValues>
    <name>ГруппаЛичныхАдресатов</name>
  </enumValues>
  <enumValues>
    <name>КонтактноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>ЛичныйАдресат</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>Раздел</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Catalogs/АдреснаяКнига/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если Предопределенный Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Раздел;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Пользователи") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Пользователь;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Заказчики") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Заказчик;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.КонтактныеЛицаЗаказчиков") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.КонтактноеЛицо;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГруппыЛичныхАдресатов") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаЛичныхАдресатов;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ЛичныеАдресаты") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ЛичныйАдресат;
	ИначеЕсли ТипОбъекта = Тип("Строка") Тогда
		
		ЭтоАвтогруппа = Ложь;
		ФункцииАвтоГрупп = РаботаСАдреснойКнигой.ПолучитьСписокДоступныхФункций();
		Для Каждого ФункцияАвтогруппа Из ФункцииАвтоГрупп Цикл
			Если ФункцияАвтогруппа.Представление = Объект Тогда
				ЭтоАвтогруппа = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоАвтогруппа Тогда
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Автогруппа;
		Иначе
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.АдресСпискаРассылки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
